#include <stdio.h>

int main()
{
    // खातामा भएको जम्मा रकम
    int मौज्दात = 500;
    int विकल्प;

    while (1)
    {
        printf("\n***********************\nएटीएम (ATM) मा स्वागत छ\nउपलब्ध सेवाहरू:\n");
        printf("१. मौज्दात हेर्नुहोस्\n२. रकम जम्मा गर्नुहोस्\n३. रकम झिक्नुहोस्\n४. बाहिरिनुहोस्\n***********************\n");

        printf("विकल्प छान्नुहोस्: ");
        scanf("%d", &विकल्प);

        // विकल्प १: मौज्दात देखाउने
        if (विकल्प == 1)
        {
            printf("तपाईंको मौज्दात रु %d छ।\n", मौज्दात);
        }
        // विकल्प २: रकम थप्ने
        else if (विकल्प == 2)
        {
            int जम्मा_गरिने_रकम;
            printf("जम्मा गर्ने रकम लेख्नुहोस्: ");
            scanf("%d", &जम्मा_गरिने_रकम);
            मौज्दात += जम्मा_गरिने_रकम;
            printf("रकम जम्मा भयो। नयाँ मौज्दात: रु %d\n", मौज्दात);
        }
        // विकल्प ३: रकम निकाल्ने
        else if (विकल्प == 3)
        {
            int झिक्ने_रकम;
            printf("झिक्न चाहेको रकम लेख्नुहोस्: ");
            scanf("%d", &झिक्ने_रकम);

            if (झिक्ने_रकम > मौज्दात)
            {
                printf("माफ गर्नुहोस्, तपाईंसँग पर्याप्त रकम छैन!\n");
            }
            else
            {
                मौज्दात -= झिक्ने_रकम;
                printf("रकम लिनुहोस्। बाँकी मौज्दात: रु %d\n", मौज्दात);
            }
        }
        // विकल्प ४: बाहिरिने
        else if (विकल्प == 4)
        {
            printf("धन्यवाद, फेरि भेटौँला!\n");
            break;
        }
        // गलत इनपुट आएमा
        else
        {
            printf("गलत विकल्प! कृपया फेरि प्रयास गर्नुहोस्।\n");
        }
    }

    return 0;
}