#include <stdio.h>
#include <string.h>

int main()
{
    // प्रयोगकर्ताबाट इनपुट लिने
    char प्रयोगकर्ता_इनपुट[40];

    // यदि प्रयोगकर्ताले y लेख्यो भने अनुमति पाउँछ, n लेख्यो भने पाउँदैन
    printf("\n: ");

    scanf("%s", प्रयोगकर्ता_इनपुट);

    printf("प्रयोगकर्ताले ['%s'] भन्नुभयो\n", प्रयोगकर्ता_इनपुट);

    // प्रयोगकर्ताले y लेखेको छ कि छैन भनेर तुलना गर्ने

    // strcmp ले मिल्यो भने 0 फर्काउँछ, नमिल्यो भने 1
    if (strcmp(प्रयोगकर्ता_इनपुट, "y") == 0)
    {
        printf("ठिक छ, तपाईं खेलमा प्रवेश गर्दै हुनुहुन्छ");
        // यो block भित्र पसेपछि function चल्छ
    }
    else
    {
        printf("माफ गर्नुहोस्, तपाईंलाई अनुमति छैन");
    }

    int क, ख, चिन्ह;

    printf("क को मान हाल्नुहोस् : ");
    scanf("%d", &क);

    printf("ख को मान हाल्नुहोस् : ");
    scanf("%d", &ख);

    printf("चिन्ह हाल्नुहोस् : जस्तै + - * / : ");

    // इनपुट गरिएका संख्या देखाउने
    printf("%d", क);
    printf("%d", ख);

    return 0;
}
